class BasePageData:
    # страница тестового стенда
    BASE_URL = 'https://qa-scooter.praktikum-services.ru/'

    # страница Дзена
    DZEN_URL = 'https://dzen.ru/?yredirect=true'

    # текст ответа на первый вопрос: «Сколько это стоит? И как оплатить?»
    FIRST_ANSWER_TEXT = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'

    # текст ответа на второй вопрос: «Хочу сразу несколько самокатов! Так можно?»
    SECOND_ANSWER_TEXT = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'

    # текст ответа на третий вопрос: «Как рассчитывается время аренды?»
    THIRD_ANSWER_TEXT = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'

    # текст ответа на четвертый вопрос: «Можно ли заказать самокат прямо на сегодня?»
    FOURTH_ANSWER_TEXT = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'

    # текст ответа на пятый вопрос: «Можно ли продлить заказ или вернуть самокат раньше?»
    FIFTH_ANSWER_TEXT = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'

    # текст ответа на шестой вопрос: «Вы привозите зарядку вместе с самокатом?»
    SIXTH_ANSWER_TEXT = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'

    # текст ответа на седьмой вопрос: «Можно ли отменить заказ?»
    SEVENTH_ANSWER_TEXT = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'

    # текст ответа на восьмой вопрос: «Я жизу за МКАДом, привезёте?»
    EIGHTH_ANSWER_TEXT = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
