class OrderPageData:
    # текст для ввода в поле «Имя»
    FIRST_NAME_TEXT_1 = 'Ирина'
    FIRST_NAME_TEXT_2 = 'Вова'

    # текст для ввода в поле «Фамилия»
    LAST_NAME_TEXT_1 = 'Орешкина'
    LAST_NAME_TEXT_2 = 'Пупкин'

    # текст для ввода в поле «Адрес: куда привезти заказ»
    ADDRESS_TEXT_1 = 'г. Москва, ул. Молодёжная'
    ADDRESS_TEXT_2 = 'г. Москва, Кремль'

    # название станции метро «Парк культуры»
    STATION_METRO_TEXT_1 = 'Парк культуры'
    STATION_METRO_TEXT_2 = 'Александровский сад'

    # текст для ввода в поле «Телефон: на него позвонит курьер»
    PHONE_NUMBER_1 = '+79261234567'
    PHONE_NUMBER_2 = '84959990000'

    # дата в календаре
    DELIVERY_DATE_1 = '02.02.2025'
    DELIVERY_DATE_2 = '03.03.2025'

    # текст для ввода в поле «Комментарий для курьера»
    COMMENT_COURIER_TEXT_1 = 'Привет.'
    COMMENT_COURIER_TEXT_2 = 'Пока.'

    # текст кнопки «Отменить заказ»
    CANCEL_ORDER_TEXT = 'Отменить заказ'